%---------------------------------------------------------------------------%
                  % 子程序 “Intde1.m”作用量测量契合度计算             
                  % 入口参数：量测参数矩阵mdata，量测矢量z
                  %          量测函数矢量h
                  % 返回参数：契合度ksi
%---------------------------------------------------------------------------%
function ksi = Intde1(mdata,z,h)
    summ=0;
    for i=1:size(z,1)
        sigma=2*sqrt(1/mdata(i,5));
        summ=summ+exp(-(z(i)-h(i))^2/2/(sigma^2)); 
    end
    ksi=summ/(size(z,1))*100;
end
