%---------------------------------------------------------------------------%
                  % 子程序 “Intde.m”作用量测量契合度计算             
                  % 入口参数：量测参数矩阵mdata，有功量测矢量Za,
                  %          无功量测矢量Zr,有功量测函数矢量ha,
                  %          无功量测函数矢量hr
                  % 返回参数：契合度ksi
%---------------------------------------------------------------------------%
function ksi = Intde(mdata,Za,Zr,ha,hr)
    summ=0;
    Z=[Za;Zr];
    h=[ha;hr];
    for i=1:size(Z,1)
        sigma=2*sqrt(1/mdata(i,5));
        summ=summ+exp(-(Z(i)-h(i))^2/2/(sigma^2)); % 14\57\118取0.002；736取0.04
    end
    ksi=summ/(size(Z,1))*100;
end
